'use strict';

module.exports = {
   async up (queryInterface, Sequelize) {

      await queryInterface.bulkInsert('Tours', [
         {
            shopId: await queryInterface.rawSelect('Shops', {where: {name: 'G&Q'}}, ['id']),
            name: 'Ранкова прогулянка',
            info: `Одноденна прогулянка протокою Перебійна з переходом у рукав р. Конка й далі на канали 
            Спортивний і Олешківський. Рухаючись Олешківським відгалуженням, мандрівники запливають до 
            Чортового коліна й на виході з нього потрапляють у Спортивну Конку, де регулярно проходять 
            змагання з веслування. Всі охочі можуть відчути атмосферу спортивних перегонів та позмагатися у 
            веслуванні на короткій дистанції.`,
            price: 5000,
         },
         {
            shopId: await queryInterface.rawSelect('Shops', {where: {name: 'G&Q'}}, ['id']),
            name: 'Індивідуальні прогулянки',
            info: `Захоплива екскурсія річкою Дніпро з виходом у рукав протоки Кошова. Під час подорожі можна 
            спостерігати за портом Херсона з його баржами, човнами та іншими судами. Віддаляючись углиб річки, 
            змінюється пейзаж міська панорама поступається невеликим протокам і озерам із заростями латаття й 
            очерету, серед якого ховається безліч птахів. Далі шлях лежить через Стебліївський лиман до озера 
            Чічужне. Ввечері група повертається до Херсона.`,
            price: 23820,
         },
         {
            shopId: await queryInterface.rawSelect('Shops', {where: {name: 'Reel'}}, ['id']),
            name: 'Захід сонця на воді',
            info: `Під час екскурсії можна побачити, як добувають пісок у Кардашинському піщаному кар'єрі, після 
            чого вузькими протоками та єриками попрямувати до херсонської Венеції. В дорозі можна позмагатися у 
            веслуванні на швидкість. Вам пощастить побачити неймовірно гарні розквітлі білі лотоси, качок-нирків, 
            які то з'являються, то пропадають у воді, остовпілі зграї чапель, інших різноманітних птахів, вужів, 
            черепах.`,
            price: 8120,
         },
         {
            shopId: await queryInterface.rawSelect('Shops', {where: {name: 'Dolphins'}}, ['id']),
            name: 'Дводенний сплав дельтою',
            info: `Захоплива екскурсія річкою Дніпро з виходом у рукав протоки Кошова. Під час подорожі можна 
            спостерігати за портом Херсона з його баржами, човнами та іншими судами. Віддаляючись углиб річки, 
            змінюється пейзаж міська панорама поступається невеликим протокам і озерам із заростями латаття й 
            очерету, серед якого ховається безліч птахів. Далі шлях лежить через Стебліївський лиман до озера 
            Чічужне. Ввечері група повертається до Херсона.`,
            price: 13550,
         },
         {
            shopId: await queryInterface.rawSelect('Shops', {where: {name: 'Dolphins'}}, ['id']),
            name: 'Прогулянка на дельфінах',
            info: 'Буде дуже мокренько, адже дельфіни милі =)',
            price: 20000,
         },


      ], {});

   },

   async down (queryInterface, Sequelize) {
      await queryInterface.bulkDelete('Tours', null, {});
   }
};